In [5]:
import os
import pandas as pd

In [6]:
os.getcwd()

'C:\\Users\\460379\\Python Projects ineuron\\Python_Excel_Automation'

In [7]:
os.listdir()

['.ipynb_checkpoints', 'StudentsPerformance.csv', 'Untitled.ipynb']

In [21]:
# Convert the txt file into a csv file and access the dataset

df = pd.read_csv (r'C:\Users\460379\Python Projects ineuron\Python_Excel_Automation\StudentsPerformance.txt')
df.to_csv (r'C:\Users\460379\Python Projects ineuron\Python_Excel_Automation\StudentsPerformance.csv', index=None)

In [22]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [24]:
df.shape

(1000, 8)

In [25]:
# Show the information about the dataframes or datasets

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [26]:
# Get basic statistics of the datasets or dataframes

df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [28]:
#Get access to the index of the dataframe or dataset

df.index

RangeIndex(start=0, stop=1000, step=1)

In [32]:
#Get access to datatypes of each columns or attributes. Objects are same as strings and Int is numbers integers

df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [33]:
#Get the length of the dataframe(Number of rows). Use "len(name of the dataframe)"

len(df)

1000

In [35]:
#Get the highest index of the dataframe

max(df.index)

999

In [36]:
# Get the lowest of the dataframe

min(df.index)

0

In [38]:
# Get the datatype of the dataframe

type(df)

pandas.core.frame.DataFrame

In [39]:
#Rounding the values of datasets if there are any floats

round(df, 2) #Where 2 is the decimals to be rounded off

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [40]:
# Select a column from the dataset or dataframe

df['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [41]:
# Check the datatype of a particular column

type(df["gender"])

pandas.core.series.Series

In [47]:
# Select two or more columns from the datasets or dataframe by using "[[]]"

df[['gender', 'math score']]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [53]:
df[['gender', 'math score']].mean()

C:\Users\460379\AppData\Local\Temp\1\ipykernel_21520\610046669.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[['gender', 'math score']].mean()

math score    66.089
dtype: float64